{
  "posts": [
    { "id": 1, "title": "json-server", "author": "Vinicius Aguiar" },
    { "id": 2, "title": "React-Js", "author": "Vinicius Aguiar" },
    { "id": 3, "title": "Node-Js", "author": "Vinicius Aguiar" },
    { "id": 4, "title": "Mongo-DB", "author": "Vinicius Aguiar" },
    { "id": 5, "title": "PHP", "author": "Vinicius Aguiar" },
    { "id": 6, "title": "Laravel", "author": "Vinicius Aguiar" }
  ],
  "comments": [
    { "id": 1, "body": "O que é o JSON Server? Ter uma API pronta para começar o desenvolvimento do front-end da sua aplicação as vezes pode ser um problema. Com isso te apresento o JSON Server. JSON Server é uma biblioteca capaz de criar uma API Fake em 30 segundos e sem precisar escrever nenhuma linha de código.", "postId": 1 },
    { "id": 2, "body": "React faz com que a criação de UIs interativas seja uma tarefa fácil. Crie views simples para cada estado na sua aplicação, e o React irá atualizar e renderizar de forma eficiente apenas os componentes necessários na medida em que os dados mudam.", "postId": 2 },
    { "id": 3, "body": "De acordo com sua definição oficial, o Node é um runtime, que nada mais é do que um conjunto de códigos, API's, ou seja, são bibliotecas responsáveis pelo tempo de execução (é o que faz o seu programa rodar) que funciona como um interpretador de JavaScript fora do ambiente do navegador web.", "postId": 3 },
    { "id": 4, "body": "MongoDB é um software de banco de dados orientado a documentos livre, de código aberto e multiplataforma, escrito na linguagem C++. Classificado como um programa de banco de dados NoSQL, o MongoDB usa documentos semelhantes a JSON com esquemas.", "postId": 4 },
    { "id": 5, "body": "Traduzido do inglês-PHP é uma linguagem de script de uso geral voltada para o desenvolvimento da web. Ele foi originalmente criado pelo programador dinamarquês-canadense Rasmus Lerdorf em 1993 e lançado em 1995. A implementação de referência do PHP agora é produzida pelo The PHP Group.", "postId": 5 },
    { "id": 6, "body": "Laravel é um framework PHP livre e open-source criado por Taylor B. Otwell para o desenvolvimento de sistemas web que utilizam o padrão MVC.", "postId": 6 }
  ],
  "profile": { "name": "github.com/ProfessorAguiar" }
}